
const kaoMojis = [
    '(╯°□°)╯︵ ┻━┻',
    '(ノಠ益ಠ)ノ',
    '(´；ω；`)',
    '٩(◕‿◕｡)۶',
    '(´。• ᵕ •。`)',
    '(๑•́ ω •̀๑)',
    '(´ω`)',
    '(ノ°ο°)ノ',
    '(╯°□°)╯',
    '(´；ω；`)',
    ' ┻━┻ ︵ヽ(`Д´)ﾉ︵ ┻━┻',
    '( ˶ˆ꒳ˆ˵ )',
    '(˶ᵔ ᵕ ᵔ˶)',
    '(∂ω∂)',
    '(*´ω｀*)',
    '(๑•﹏•)',
    '(*•̀ᴗ•́*)',
    '(๑ゝω╹๑)',
    '(๑ó⌓ò๑)',
    '⊂( *·ω· )⊃',
    'ヽ(。·ω·。)ﾉ',
    '(◍ᐡᐤ ᐡ◍)',
    '(◔ω◔ * ）',
    '(՞•֊•՞)',
    '◉‿◉',
    '(˶◜ᵕ◝˶)',
    '( ˶\'ᵕ\'˶)',
    'ෆ',
    '*⸜( •ᴗ• )⸝*',
    '( ́⌒ .̫ ⌒ ̀)',
    'ヽ(ヅ)ノ',
    '(⩌⩊⩌)',
    '(◍´͈ ᵕ`͈ ◍)',
    '(ﾉ ˃ˋᗜˊ˂ )ﾉ',
    '(=^ェ^=)',
    '(ﾉ´∩｡• ᵕ •｡∩)ﾉ',
    '(⁎ᴗ͈ ⩊ ᴗ͈⁎)',
];

export const getRandomMoji = (): string => {
    return selectRandom(kaoMojis);
}

const selectRandom = <T>(list: T[]): T => {
    const index = Math.floor(Math.random() * list.length);
    return list[index];
}